performance_results_real/html_report/statistics.json
{
  "Health Check" : {
    "transaction" : "Health Check",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.0,
    "medianResTime" : 9.5,
    "minResTime" : 2.0,
    "maxResTime" : 50.0,
    "pct1ResTime" : 47.0,
    "pct2ResTime" : 48.449999999999996,
    "pct3ResTime" : 50.0,
    "throughput" : 18.34862385321101,
    "receivedKBytesPerSec" : 4.0495986238532105,
    "sentKBytesPerSec" : 2.4010894495412844
  },
  "Get All Users" : {
    "transaction" : "Get All Users",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.959999999999997,
    "medianResTime" : 6.5,
    "minResTime" : 1.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 18.799999999999997,
    "pct2ResTime" : 25.949999999999953,
    "pct3ResTime" : 48.0,
    "throughput" : 18.58736059479554,
    "receivedKBytesPerSec" : 41.22255460037175,
    "sentKBytesPerSec" : 2.4141786710037176
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.69333333333333,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 45.900000000000006,
    "pct2ResTime" : 47.44999999999999,
    "pct3ResTime" : 53.940000000000055,
    "throughput" : 54.88474204171241,
    "receivedKBytesPerSec" : 50.4718086809367,
    "sentKBytesPerSec" : 7.182183040614709
  },
  "Get User by ID" : {
    "transaction" : "Get User by ID",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.119999999999997,
    "medianResTime" : 8.5,
    "minResTime" : 1.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 47.0,
    "pct2ResTime" : 49.89999999999999,
    "pct3ResTime" : 57.0,
    "throughput" : 18.294914013904133,
    "receivedKBytesPerSec" : 5.860089645078668,
    "sentKBytesPerSec" : 2.4119271405049396
  }
}